src/cf/src/DataProcessors/РаспределениеАктивовОрганизации/РаспределениеАктивовОрганизации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>РаспределениеАктивовОрганизации</name>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидНоменклатуры</name>
    <type>
      <types>CatalogRef.ВидыНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>ИнформацияПоАктивам</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СписокРабочихМест</name>
    <attributes>
      <name>РабочееМесто</name>
      <type>
        <types>CatalogRef.РабочиеМеста</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Используется</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

src/cf/src/InformationRegisters/УчетОборудованияРабочихМест/УчетОборудованияРабочихМест.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>УчетОборудованияРабочихМест</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>РабочееМесто</name>
    <type>
      <types>CatalogRef.РабочиеМеста</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/cf/src/Catalogs/Номенклатура/Номенклатура.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Номенклатура</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Артикул</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидНоменклатуры</name>
    <type>
      <types>CatalogRef.ВидыНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПриобретения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоХарактеристика</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>8</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаборСвойств</name>
    <type>
      <types>CatalogRef.НаборыДополнительныхРеквизитовИСведений</types>
    </type>
  </attributes>
  <attributes>
    <name>Производитель</name>
    <type>
      <types>CatalogRef.Производители</types>
    </type>
  </attributes>
  <attributes>
    <name>СрокДействия</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ФайлКартинки</name>
    <type>
      <types>CatalogRef.НоменклатураПрисоединенныеФайлы</types>
    </type>
  </attributes>
  <attributes>
    <name>ШтрихКод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/cf/src/Catalogs/РабочиеМеста/РабочиеМеста.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>РабочиеМеста</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Сервер</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнойШаблонУдаленногоДоступа</name>
    <type>
      <types>CatalogRef.ШаблоныУдаленногоДоступа</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФайлКартинки</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ИндексКартинки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>СписокРабочихИнструментов</name>
    <attributes>
      <name>ВидНоменклатуры</name>
      <type>
        <types>CatalogRef.ВидыНоменклатуры</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/cf/src/DataProcessors/РаспределениеАктивовОрганизации/Forms/Форма/Module.bsl
#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Заполнить(Команда)
	
	ЗаполнитьСписок();  
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписок()

	  Запрос = Новый Запрос;
	  Запрос.Текст = "ВЫБРАТЬ
	                 |	РабочиеМеста.Ссылка КАК РабочееМесто,
	                 |	ЕСТЬNULL(ВложенныйЗапрос.Номенклатура, ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)) КАК Номенклатура,
	                 |	ЕСТЬNULL(ВложенныйЗапрос.Количество, 0) КАК Используется
	                 |ИЗ
	                 |	Справочник.РабочиеМеста КАК РабочиеМеста
	                 |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	                 |			УчетОборудованияРабочихМест.Организация КАК Организация,
	                 |			УчетОборудованияРабочихМест.РабочееМесто КАК РабочееМесто,
	                 |			УчетОборудованияРабочихМест.Номенклатура КАК Номенклатура,
	                 |			УчетОборудованияРабочихМест.Количество КАК Количество
	                 |		ИЗ
	                 |			РегистрСведений.УчетОборудованияРабочихМест КАК УчетОборудованияРабочихМест
	                 |		ГДЕ
	                 |			УчетОборудованияРабочихМест.Номенклатура.ВидНоменклатуры = &ВидНоменклатуры
	                 |			И УчетОборудованияРабочихМест.Организация = &Организация) КАК ВложенныйЗапрос
	                 |		ПО РабочиеМеста.Ссылка = ВложенныйЗапрос.РабочееМесто
	                 |ГДЕ
	                 |	РабочиеМеста.Организация = &Организация
	                 |	И РабочиеМеста.СписокРабочихИнструментов.ВидНоменклатуры = &ВидНоменклатуры
	                 |
	                 |УПОРЯДОЧИТЬ ПО
	                 |	РабочиеМеста.Наименование";
	  
	  Запрос.УстановитьПараметр("Организация", Объект.Организация);
	  Запрос.УстановитьПараметр("ВидНоменклатуры", Объект.ВидНоменклатуры);
	  
	  Результат = Запрос.Выполнить();
	  Выборка = Результат.Выгрузить();
	  
	  Объект.СписокРабочихМест.Загрузить(Выборка);
	  

      //Для поля ИнформацияПоАктивам
	  
	  Запрос = Новый Запрос;
	  Запрос.Текст = "ВЫБРАТЬ
	                 |	ВложенныйЗапрос.Номенклатура,
	                 |	ВложенныйЗапрос.Номенклатура.КоличествоХарактеристика КАК КоличествоХарактеристика,
	                 |	ВложенныйЗапрос.Количество
	                 |ИЗ
	                 |	(ВЫБРАТЬ
	                 |		УчетОборудованияРабочихМест.Номенклатура КАК Номенклатура,
	                 |		СУММА(УчетОборудованияРабочихМест.Количество) КАК Количество
	                 |	ИЗ
	                 |		РегистрСведений.УчетОборудованияРабочихМест КАК УчетОборудованияРабочихМест
	                 |	ГДЕ
	                 |		УчетОборудованияРабочихМест.Номенклатура.ВидНоменклатуры = &ВидНоменклатуры
	                 |	
	                 |	СГРУППИРОВАТЬ ПО
	                 |		УчетОборудованияРабочихМест.Номенклатура) КАК ВложенныйЗапрос
	                 |
	                 |УПОРЯДОЧИТЬ ПО
	                 |	ВложенныйЗапрос.Номенклатура.Наименование";
	  
	  Запрос.УстановитьПараметр("Организация", Объект.Организация);
	  Запрос.УстановитьПараметр("ВидНоменклатуры", Объект.ВидНоменклатуры);
	  
	  Результат = Запрос.Выполнить();
	  Выборка = Результат.Выбрать();
	  
	  Объект.ИнформацияПоАктивам = "По "+Объект.ВидНоменклатуры.Наименование+":"+Символы.ПС;
	  
	  Пока Выборка.Следующий() Цикл
	  
		  Остаток = Выборка.КоличествоХарактеристика - Выборка.Количество;
		  ТекстИнформацииПоАктивам = СтрШаблон(НСтр("ru = '%1 - %2: %3 (%4) остаток: %5
                                                     |'"), "", Выборка.Номенклатура, Выборка.Количество, Выборка.КоличествоХарактеристика, Остаток);
		  Объект.ИнформацияПоАктивам = Объект.ИнформацияПоАктивам + ТекстИнформацииПоАктивам;
			
	  КонецЦикла;
	  
	  КолВоНеиспользуемых = Объект.СписокРабочихМест.Количество() - Объект.СписокРабочихМест.Итог("Используется");
	  ТекстИнформацииПоАктивам = СтрШаблон(НСтр("ru = '%1
                                                 |
                                                 |Осталось не задействованных рабочих мест (по выбранной организации): %2'"), Объект.ИнформацияПоАктивам, КолВоНеиспользуемых);
	  Объект.ИнформацияПоАктивам = ТекстИнформацииПоАктивам;
	  
КонецПроцедуры

&НаКлиенте
Процедура СохранитьИзменения(Команда)
	
	СохранитьИзменениеАктивовРабочихМест();
	
	ЗаполнитьСписок();
	
КонецПроцедуры

&НаСервере
Процедура СохранитьИзменениеАктивовРабочихМест()

	Если Не ЗначениеЗаполнено(Объект.Организация) Тогда
		ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Необходимо указать организацию.'"),,"Объект.Организация");
		Возврат;
	КонецЕсли;
	
	Для каждого ТекСтрокаРабочегоМеста Из Объект.СписокРабочихМест Цикл
		
		Если ТекСтрокаРабочегоМеста.РабочееМесто.Пустая() 
			Или (ТекСтрокаРабочегоМеста.Номенклатура.Пустая() 
				И ТекСтрокаРабочегоМеста.Используется=0) Тогда
			Продолжить;
		КонецЕсли;		
		
		//Проверка остатка
		СтруктураДанных = Новый Структура;
		СтруктураДанных.Вставить("РабочееМесто",ТекСтрокаРабочегоМеста.РабочееМесто);
		СтруктураДанных.Вставить("ВидНоменклатуры",Объект.ВидНоменклатуры);
		НайдДанные = УправлениеИТАктивами.ДанныеОбАктивах(СтруктураДанных);
		Если Не НайдДанные.Организация.Пустая() Тогда
			НоменклатураВыбр = НайдДанные.Номенклатура;
		Иначе
			НоменклатураВыбр = ТекСтрокаРабочегоМеста.Номенклатура;			
		КонецЕсли;
		
		ЗаписьУчетаОборудования = РегистрыСведений.УчетОборудованияРабочихМест.СоздатьМенеджерЗаписи();
		ЗаписьУчетаОборудования.Организация  = Объект.Организация;
		ЗаписьУчетаОборудования.РабочееМесто = ТекСтрокаРабочегоМеста.РабочееМесто;
		ЗаписьУчетаОборудования.Номенклатура = НоменклатураВыбр;
		ЗаписьУчетаОборудования.Прочитать();
		
		Если НЕ ЗаписьУчетаОборудования.Выбран() Тогда
			
			ЗаписьУчетаОборудования = РегистрыСведений.УчетОборудованияРабочихМест.СоздатьМенеджерЗаписи();
			ЗаписьУчетаОборудования.Организация  = Объект.Организация;
			ЗаписьУчетаОборудования.РабочееМесто = ТекСтрокаРабочегоМеста.РабочееМесто;
			ЗаписьУчетаОборудования.Номенклатура = ТекСтрокаРабочегоМеста.Номенклатура;
			
		ИначеЕсли ЗаписьУчетаОборудования.Выбран() 
			И НоменклатураВыбр <> ТекСтрокаРабочегоМеста.Номенклатура Тогда
			
			ЗаписьУчетаОборудования.Удалить();
			ЗаписьУчетаОборудования = РегистрыСведений.УчетОборудованияРабочихМест.СоздатьМенеджерЗаписи();
			ЗаписьУчетаОборудования.Организация  = Объект.Организация;
			ЗаписьУчетаОборудования.РабочееМесто = ТекСтрокаРабочегоМеста.РабочееМесто;
			ЗаписьУчетаОборудования.Номенклатура = ТекСтрокаРабочегоМеста.Номенклатура;	
			
		КонецЕсли;
		
		ЗаписьУчетаОборудования.Количество = 1;
		Если Не (ТекСтрокаРабочегоМеста.Используется=1 
			И ТекСтрокаРабочегоМеста.Номенклатура.Пустая()) Тогда
		   	ЗаписьУчетаОборудования.Записать();
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
